Repository: common-repository/sticky-header-2020
Catalog: langs/sh2020-*.po
Languages: ro_ro

source: Sticky Header 2020
ro_ro: Antet Sticky 2020

source: This plugin appends custom functionality to the native customizer and provides the settings for making the header sticky, with settings for scroll minification, shadow, background, spacing, text, menu and icons colors, etc. This is compatible with Twenty Twenty -> Twenty Twenty-Four, Astra, and Hello Elementor themes.
ro_ro: Acest modul adaugă funcționalitate specifică personalizatorului nativ și furnizează setările pentru a face partea de sus lipicioasă, cu setări pentru minificare la derulare, umbră, culori pentru fundal, spațiere, text, meniu și iconițe, etc. Acesta este compatibil cu temele Twenty Twenty -> Twenty Twenty-Four, Astra și Hello Elementor.

source: Sticky Header
ro_ro: Antet Sticky

source: Here you can adjust specific settings for the theme sticky header. Please note that the settings below apply if the sticky header is enabled.
ro_ro: Aici puteți ajusta setări specifice pentru antetul sticky al temei. Vă rugăm să rețineți că setările de mai jos se aplică dacă antetul sticky este activat.

source: You are using the free version, some settings are available only in the %1$s version.<br>See more %2$sdetails%3$s.
ro_ro: Folosiți versiunea gratuită, unele setări sunt disponibile doar în versiunea %1$s.<br>Vedeți mai multe %2$sdetalii%3$s.

source: Header Selector (ID)
ro_ro: Selector antet (ID)

source: default
ro_ro: implicit

source: The selector for the header element for theme: <ol><li>Twenty Twenty - %1$s</li><li>Twenty Twenty-One and Astra - %2$s</li><li>Twenty Twenty-Two, Twenty Twenty-Three, and Twenty Twenty-Four - %3$s</li><li>Hello Elementor - %4$s</li></ol>
ro_ro: Selectorul pentru elementul antet al temei: <ol><li>Twenty Twenty - %1$s</li><li>Twenty Twenty-One și Astra - %2$s</li><li>Twenty Twenty-Two, Twenty Twenty-Three și Twenty Twenty-Four - %3$s</li><li>Hello Elementor - %4$s</li></ol>

source: Make the header sticky
ro_ro: Fă antetul sticky

source: Make the header align full (useful for Gutenberg compatible themes, like Twenty Twenty-One for example)
ro_ro: Fă antetul să se alinieze complet (util pentru temele compatibile cu Gutenbers, ca de exemplu Twenty Twenty-One)

source: Remove the header sticky settings when the plugin is disabled
ro_ro: Ștergeți setările antetul sticky când modulul este dezactivat

source: Header General Settings
ro_ro: Setări generale antet

source: The settings below will change the header height and will display a resized logo based on the header height and the vertical spacing (the logo and menu top and bottom spacing) you set here. The units can be <b>px</b>, <b>em</b>, <b>rem</b>, <b>%</b> or <b>vh</b> (it's recommended to use px for a more accurate result).
ro_ro: Setările de mai jos vor schimba înălțimea antetului și vor afișa o siglă scalată în funcție de înălțimea antetului și de spațierea verticală (spațierea sus și jos a siglei și meniului) pe care le setați aici. Unitățile pot fi <b>px</b>, <b>em</b>, <b>rem</b>, <b>%</b> or <b>vh</b> (se recomandă folosirea de px pentru un rezultat cât mai fidel).

source: Background Color
ro_ro: Culoare fundal

source: Minified Header Background Color
ro_ro: Culoare fundal antet minificat

source: Header Height
ro_ro: Înălțime antet

source: Vertical Spacing
ro_ro: Spațiere verticală

source: The header shadow options.
ro_ro: Opțiunile de umbră pentru antet.

source: Box Shadow Size
ro_ro: Mărime umbră

source: Box Shadow Color
ro_ro: Culoare umbră

source: When you scroll the page, the header (also the logo) will reduce its height. The settings for the minified header can be adjusted below. To preview the changes you have to scroll up and down the page.
ro_ro: Când derulați pagina, antetul (cu tot cu siglă) îți va reduce înălțimea. Setările pentru antetul minificat se pot modifica de mai jos. Pentru a previzualiza modificările trebuie să derulați pagina în sus și în jos.

source: Minified Header Height
ro_ro: Înălțime antet minificat

source: Minified Vertical Spacing
ro_ro: Spațiere verticală minificată

source: Mobile/Tablet Header
ro_ro: Antet mobil/tabletă

source: The settings for the mobile/tablet devices header can be adjusted below.
ro_ro: Setările pentru antetul pe dispozitivele mobile/tablete se pot modifica mai jos.

source: Mobile/Tablet Vertical Spacing
ro_ro: Spațiere verticală mobil/tabletă

source: Header Elements Colors
ro_ro: Culoari elemente antet

source: The settings below will applied to the elements inside the sticky header.
ro_ro: Setările de mai jos se aplică elementelor din interiorul antetului sticky.

source: Text/Separators Color
ro_ro: Culoare text/separatori

source: Icons Color
ro_ro: Culoare iconițe

source: Links Color
ro_ro: Culoare legături

source: Links Hover Color
ro_ro: Culoare legături active

source: Menu & Submenu Extra Options
ro_ro: Extra opțiuni meniu & submeniu

source: Apart from the links color, you can adjust the icon, the submenu background and the current item color.
ro_ro: În afară de culoarea legăturilor, puteți ajusta culoarea pentru iconiță, fundal submeniu și cea a elementului curent.

source: Icons Color for Menu & Submenu
ro_ro: Culoare iconițe pentru meniu & submeniu

source: Link Color for Current Menu Item
ro_ro: Culoare legătură pentru element meniu curent

source: Submenu Background Color
ro_ro: Culoare fundal submeniu

source: No decoration for menu items
ro_ro: Nici o decorațiune pentru elemente de meniu

source: Hide Labels
ro_ro: Ascundeți etichete

source: Hide the texts under the menu and search icons.
ro_ro: Ascundeți textele de sub iconițele de meniu și căutare.

source: Hide the menu label
ro_ro: Ascundeți eticheta meniului

source: Hide the search label
ro_ro: Ascundeți eticheta căutării

source: If any of the customizer settings above did not update the preview correctly, you can click to %1$sRefresh the preview%2$s
ro_ro: Dacă oricare dintre setările de customizare de mai sus nu au actualizat corect previzualizarea, puteți apăsa ca să %1$sActualizați previzualizarea%2$s

source: Click to reset to default all the settings of this plugin (this will also turn off the sticky header and the styles will not override the theme defaults).
ro_ro: Apăsați ca să resetați toate setările acestui modul (această operațiune va dezactiva și antetul sticky și stilurile nu le vor mai suprascrie pe cele ale temei).

source: Reset
ro_ro: Resetare

source: Available in the %1$s version.
ro_ro: Disponibil în versiunea %1$s.

source: Action not allowed.
ro_ro: Acțiune nepermisă.

source: Sticky Header 2020 Settings
ro_ro: Setări antet sticky 2020

source: Customize
ro_ro: Personalizare

source: Click the settings button to open the customizer and adjust the sticky header settings while previewing the changes.
ro_ro: Apăsați butonul setări pentru a deschide personalizatorul și să ajustați setările antetului sticky și în același timp să vizualizați modificările.

source: Settings
ro_ro: Setări

source: Hints
ro_ro: Indicii

source: If you want to see more about the pro settings, you can enable the hints (these show up in the customizer section).
ro_ro: Dacă doriți să vedeți mai multe despre setările pro, puteți să activați indiciile (aceste apar în secțiunea de personalizare).

source: Hide Hints
ro_ro: Ascunde indiciile

source: Show Hints
ro_ro: Arată indiciile

source: The JSON string can be copied and imported into another instance.
ro_ro: Șirul de caractere JSON poate fi copiat și importat într-o altă instanță.

source: Paste the JSON string then click the button to import the settings.
ro_ro: Lipiți șirul de caractere JSON, apoi apăsați butonul pentru a importa setările.

source: Read more
ro_ro: Citește mai mult

source: If you want to see more about this plugin, here are some links to the %1$s version%2$s and the %3$sfree version%4$s.
ro_ro: Dacă doriți să vedeți mai multe despre acest modul, aici sunt câteva legături la versiunea %1$s%2$s și la %3$sversiunea gratuită%4$s.

source: Security Breach
ro_ro: Breșă de securitate

source: The settings were reset to default.
ro_ro: Setările au fost resetate la cele implicite.

source: The hints are turned on.
ro_ro: Indiciile sunt dezactivate.

source: The hints are turned off.
ro_ro: Indiciile sunt activate.

source: You are using the free version.
ro_ro: Folosiți versiunea gratuită.

source: Click the button to see more and get the <a class="pro-item button button-primary" href="%1$s" target="_blank">version</a> of the plugin!
ro_ro: Apăsați butonul pentru a vedea mai multe și pentru a cumpăra <a class="pro-item button button-primary" href="%1$s" target="_blank">versiunea pro</a> a acestui modul!

source: You are using the PRO version.
ro_ro: Folosiți versiunea PRO.

source: It seems that you either did not input yet your license key, or that is not valid or has expired already.
ro_ro: Se pare că încă nu ați introdus cheia licenței ori aceasta nu este validă sau a expirat deja.

source: Click the button to get a valid license key for the <a class="pro-item button button-primary" href="%1$s" target="_blank">version</a> of the plugin!
ro_ro: Apăsați butonul pentru a cumpăra o cheie de licență validă pentru <a class="pro-item button button-primary" href="%1$s" target="_blank">versiunea pro</a> a modulului!

source: This plugin appends custom functionality to the native customizer, and provides the settings for making the header sticky, with settings for scroll minification, background, spacing, text, menu and icons colors, etc.
ro_ro: Acest modul adaugă funcționalitate specifică personalizatorului nativ și furnizează setările pentru a face antetul lipicios, cu setări pentru minificare la derulare, umbră, culori pentru fundal, spațiere, text, meniu și iconițe, etc.

source: The PRO version includes additional useful features
ro_ro: Versiunea PRO include funcționalități adiționale utile

source: Header Elements Color
ro_ro: Culoare elemente antet

source: Links & Submenu Settings
ro_ro: Setări legături și submeniu

source: The header shadow option
ro_ro: Opțiune umbră pentru antet

source: A huge thanks in advance!
ro_ro: Multe mulțumiri în avans!

source: If you find the plugin useful and would like to support my work, please consider making a <a href="%1$s" target="_blank">donation</a>. <br>It would make me very happy if you would leave a %2$s rating. %3$s
ro_ro: Dacă acest modul îți este folositor și ai dori să îmi sprijini munca, m-aș bucura dacă ai face o <a href="%1$s" target="_blank">donație</a>. <br>M-ar bucura mult dacă ai lăsa o recenzie de %2$s. %3$s

source: It would make me very happy if you would leave a %1$s rating. %2$s
ro_ro: M-ar bucura mult dacă ai lăsa o recenzie de %1$s. %2$s

source: You are using the free version. Get the <a href="%1$s" target="_blank"><b>PRO</b> version</a>.
ro_ro: Momentan folosiți versiunea gratuită. Cumpărați <a href="%1$s" target="_blank">versiunea <b>PRO</b></a>.

source: Thank you for purchasing the <a href="%1$s" target="_blank"><b>PRO</b> version</a>!
ro_ro: Mulțumesc că ai achiziționat <a href="%1$s" target="_blank">versiunea <b>PRO</b></a>!

source: %5$sCheck out my other <a href="%1$s" target="_blank" rel="noreferrer">%2$s free plugins</a> on WordPress.org and the <a href="%3$s" target="_blank" rel="noreferrer">%4$s other extensions</a> available!
ro_ro: %5$sVezi și celelalte <a href="%1$s" target="_blank" rel="noreferrer">%2$s module gratuite</a> ale mele pe WordPress.org și <a href="%3$s" target="_blank" rel="noreferrer">%4$s extensiile premium</a> disponibile!

source: %1$s plugin was activated!
ro_ro: Modulul %1$s a fost activat!

source: Cusomizer
ro_ro: Personalizator

source: Plugin URL
ro_ro: URL modul

source: Thank you for purchasing the %1$s version!<br>See more %2$sdetails%3$s.
ro_ro: Mulțumesc că ai achiziționat versiunea %1$s!<br>Vezi mai multe %2$sdetalii%3$s.

source: Currently the license key is not active and some of the PRO features are disabled. Go to license key %1$ssettings%2$s.
ro_ro: Momentan, cheia licenței nu este activă și unele funcționalități PRO sunt dezactivate. Mergeți la %1$ssetările%2$s pentru cheia licenței.

source: License Key
ro_ro: Cheie licență

source: Validate
ro_ro: Validare

source: Activate
ro_ro: Activare

source: The license key expiration date is %s.
ro_ro: Data expirării pentru cheia licenței este %s.

source: Your license key is not valid. Please validate the license key and review one more time the pro settings, these might have been reset to defaults.
ro_ro: Cheia dumneavoastră de licență nu este validă. Vă rugăm să validați cheia de licență și să verificați încă o dată setările pro, este posibil ca acestea să se reseteze.

source: The settings were imported
ro_ro: Setările au fost importate
